<?php

namespace App\Constants;


class EasySellConstant
{
    //상품 모드
    public const ITEM_REGIST = "I"; //등록
    public const ITEM_MODI   = "M"; //수정

    //셀러허브 아이디
    public const SELLERHUB_ID = "sellerhub";

    //api 기본정보
    public const LINKER_ID  = "onchannel";
    public const USER_ID_W  = "2018637410_200";    //W_패션
    public const USER_ID_W2 = "2018637410_200_1";  //DropK
    public const USER_PW    = "1234";

    // 상품 판매 상태
    public const STATUS_ON_SALE   = "001";
    public const STATUS_STOP_SALE = "004";

    public const ITEM_MADE_IN = "중국";

    public const API_SUCCESS = "SUCC";
    public const API_FAIL    = "FAIL";

    // 과세여부
    /** 과세 */
    public const TAX_TAXATION  = "001";
    /** 면세 */
    public const TAX_EXEMPTION = "002";

    // 이지셀 해외직구 카테고리
    public const DEFAULT_CATEGORY = "해외직구";

    //W 브랜드 코드
    public const W_ACCOUNT_FASHION     = 49096; //W_패션의류
    public const W_ACCOUNT_SPORTS      = 49097; //W_스포츠/레저
    public const W_ACCOUNT_GOODS       = 49098; //W_잡화/슈즈/쥬얼리
    public const W_ACCOUNT_BEAUTY      = 49099; //W_뷰티
    public const W_ACCOUNT_LUXURY      = 49100; //W_명품
    public const W_ACCOUNT_CHILD       = 49101; //W_출산/유아동
    public const W_ACCOUNT_LIFE        = 49102; //W_생활/건강
    public const W_ACCOUNT_PET         = 49103; //W_반려동물
    public const W_ACCOUNT_FOOD        = 49104; //W_식품
    public const W_ACCOUNT_DIGITAL     = 49105; //W_디지털/가전
    public const W_ACCOUNT_INTERIOR    = 49106; //W_가구/인테리어
    public const W_ACCOUNT_BOOK        = 49107; //W_도서/음반
    public const W_ACCOUNT_RADIO       = 49108; //W_무전기
    public const W_ACCOUNT_USED_LUXURY = 49109; //W_중고명품
    public const W_ACCOUNT_USED_GOODS  = 49110; //W_중고상품

    public const CATEGORY_MAPPING = [
        "066001" => self::W_ACCOUNT_FASHION,
        "066002" => self::W_ACCOUNT_SPORTS,
        "066003" => self::W_ACCOUNT_GOODS,
        "066004" => self::W_ACCOUNT_BEAUTY,
        "066005" => self::W_ACCOUNT_LUXURY,
        "066006" => self::W_ACCOUNT_CHILD,
        "066007" => self::W_ACCOUNT_LIFE,
        "066008" => self::W_ACCOUNT_PET,
        "066009" => self::W_ACCOUNT_FOOD,
        "066010" => self::W_ACCOUNT_DIGITAL,
        "066011" => self::W_ACCOUNT_INTERIOR,
        "066012" => self::W_ACCOUNT_BOOK,
        "066013" => self::W_ACCOUNT_RADIO,
        "066014" => self::W_ACCOUNT_USED_LUXURY,
        "066015" => self::W_ACCOUNT_USED_GOODS,
    ];

    public const CATEGORY_NAME = [
        "066001" => "W_패션의류",
        "066002" => "W_스포츠/레저",
        "066003" => "W_잡화/슈즈/쥬얼리",
        "066004" => "W_뷰티",
        "066005" => "W_명품",
        "066006" => "W_출산/유아동",
        "066007" => "W_생활/건강",
        "066008" => "W_반려동물",
        "066009" => "W_식품",
        "066010" => "W_디지털/가전",
        "066011" => "W_가구/인테리어",
        "066012" => "W_도서/음반",
        "066013" => "W_무전기",
        "066014" => "W_중고명품",
        "066015" => "W_중고상품",
    ];

    //이지셀 정보고시 매핑
    public const DEFAULT_NOTICE = "g12"; //기타재화
    public const NOTICE_MAPPING = [
        "066001" => [
            "g0",
            "g3" => ["066001009012"]
        ],
        "066002" => [
            "g7",
            "g0" => ["066002006001","066002001001","066002001002","066002004001","066002007001","066002007002"],
            "g1" => ["066002007003"],
            "g2" => ["066002007004"],
        ],
        "066003" => [
            "g3",
            "g1" => ["066003005001","066003005002","066003005003","066003005004","066003005005","066003006001","066003006002","066003006003","066003006004"],
            "g2" => ["066003001001","066003002001","066003002004"],
            "g5" => ["066003003001","066003004001","066003007001","066003007002","066003007003","066003007004","066003007005","066003007006"]
        ],
        "066004" => [
            "g4",
            "g20" => ["066004003004","066004003005"]
        ],
        "066005" => [
            "g3",
            "g0" => ["066005001001","066005002001"],
            "g1" => ["066005001003"],
            "g6" => ["066005001005"],
            "g7" => ["066005002002"],
        ],
        "066006" => [
            "g6"
        ],
        "066007" => [
            "g12",
            "g21" => ["066007001001"],
            "g22" => ["066007001002","066007001003","066007001004","066007001005","066007001006","066007001007","066007001008","066007001009"],
            "g23" => ["066007006001"],
            "g25" => ["066007006002","066007007001","066007007002"],
            "g11" => ["066007003001","066007008001","066007008002","066007008003","066007008004","066007008005"]

        ],
        "066008" => [
            "g12",
            "g14" => ["066008005001"]
        ],
        "066009" => [
            "g8",
            "g14" => ["066009001001","066009001002","066009001003","066009001004","066009001005","066009001006"],
            "g15" => ["066009003008"]
        ],
        "066010" => [
            "g20",
            "g16" => ["066010006001"],
            "g17" => ["066010001002"],
            "g18" => ["066010001009","066010001010","066010002006","066010003001","066010003002","066010003003","066010003006"],
            "g19" => ["066010001007","066010001008"]
        ],
        "066011" => [
            "g13",
            "g9"  => ["066011007001"],
            "g10" => ["066011007002"],
            "g11" => ["066011007003"],
            "g12" => ["066011007004","066011007009"],
            "g14" => ["066011007006","066011008001"],
            "g15" => ["066011008002","066011007007"],
            "g16" => ["066011007008","066011008003"],
            "g17" => ["066011009001"],
            "g18" => ["066011009002"],
            "g19" => ["066011009003"],
        ],
        "066012" => [
            "g24",
        ],
        "066013" => [
            "g20",
        ],
        "066014" => [
            "g3",
        ],
        "066015" => [
            "g18"
        ]
    ];

}
